tap "homebrew/cask"

brew "wget"
brew "jq"
brew "curl"
brew "watch"
brew "ffmpeg"
brew "cloc"
brew "csshx"
brew "nmap"
brew "telnet"
brew "htop"
brew "pstree"
brew "irssi"
cask "osxfuse"
brew "s3fs"

# dev
brew "make"
brew "pkg-config"
brew "go"
brew "python"
brew "jenv"
# curl -s "https://get.sdkman.io" | bash
brew "sqlite"
brew "docker"
brew "docker-compose"
brew "awscli"
cask "visual-studio-code"
cask "google-cloud-sdk"
brew "git-lfs"
brew "httpie"
brew "readline"
brew "openssl"

brew "youtube-dl"

brew "k6"

# kubernetes
brew "kubectx"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kubeseal"
brew "minikube"
brew "derailed/k9s/k9s"
cask "virtualbox"


cask "google-chrome"
cask "firefox"
